Comparition highlights added
